Revit API Introduction Labs
Lab3_3_DetermineInstanceTypeAndFamily Class
 For a selected family instance in the model, determine its type and family.
 This lab shows how to determine the family and type of a family instance element. We look at two simple scenarios. In Lab 3-1, we listed all symbols by looping over the contents of the symbols property for each family found in the model. Here, we first list all loaded standard family symbols belonging to a category, such as 'Windows'. For this we can filter for all elements which match the 'Windows' category AND the 'FamilySymbol' type. Once we have retrieved the loaded family symbols, we can directly access their Family and Name properties to display them.
CopyC#
FamilySymbol fs = inst.Symbol;
Family f = fs.Family;
CopyVB.NET
Dim fs As FamilySymbol = inst.Symbol
Dim f As Family = fs.Family
 Build, load and run the command and examine the output in a model with a few windows instances. Notice the intriguing fact that some of the family symbols are listed multiple times if used for any instances.
Why do two different family symbols have the same name?
 In Revit, a symbol represents geometry, and we have the concept of master and slave family symbols.
 Consider two window instances of the same type, but inserted into walls of different types. Now, these two window instances refer to the same family symbol and count as being of the same type, but it is clear that they cannot possibly use the same symbol geometry, since they have different thickness. Hence master and slave symbols are used.
 For instance, if there is no door instance in project, there will be only one master symbol for 36"x84" doors. Now, if the user draws a wall and places a door into it, Revit will create a slave symbol for 36"x84". If she then draws a different type of wall and places a new door of the same type in this new wall, Revit will create another slave symbol for 36"x84". Then there will be one master symbol and two slave symbols in the project.
There is currently no API to query the symbol whether it is master or slave.
 Both of the symbols have the same parent family class instance and either are usable for editing existing or creating new instances, so there is no issue with this.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_3_DetermineInstanceTypeAndFamily : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_3_DetermineInstanceTypeAndFamily _
	Implements IExternalCommand
Visual C++
public ref class Lab3_3_DetermineInstanceTypeAndFamily : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_3_DetermineInstanceTypeAndFamily
See Also
Lab3_3_DetermineInstanceTypeAndFamily Members
Labs Namespace